Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ16GS504.h
extern volatile ADCPC0BITS ADCPC0bits __attribute__((__sfr__));

#define ADCPC1 ADCPC1
extern volatile unsigned int  ADCPC1 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC1BITS {
  union {
    struct {
      unsigned TRGSRC2:5;
      unsigned SWTRG2:1;
      unsigned PEND2:1;
      unsigned IRQEN2:1;
      unsigned TRGSRC3:5;
      unsigned SWTRG3:1;
      unsigned PEND3:1;
      unsigned IRQEN3:1;
    };
    struct {
      unsigned TRGSRC20:1;
      unsigned TRGSRC21:1;
      unsigned TRGSRC22:1;
      unsigned TRGSRC23:1;
      unsigned TRGSRC24:1;
      unsigned :3;
      unsigned TRGSRC30:1;
      unsigned TRGSRC31:1;
      unsigned TRGSRC32:1;
      unsigned TRGSRC33:1;
      unsigned TRGSRC34:1;
    };
  };
} ADCPC1BITS;
extern volatile ADCPC1BITS ADCPC1bits __attribute__((__sfr__));

#define ADCPC2 ADCPC2
extern volatile unsigned int  ADCPC2 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC2BITS {
  union {
    struct {
      unsigned TRGSRC4:5;
      unsigned SWTRG4:1;
      unsigned PEND4:1;
      unsigned IRQEN4:1;
      unsigned TRGSRC5:5;
      unsigned SWTRG5:1;
      unsigned PEND5:1;
      unsigned IRQEN5:1;
    };
    struct {
      unsigned TRGSRC40:1;
      unsigned TRGSRC41:1;
      unsigned TRGSRC42:1;
      unsigned TRGSRC43:1;
      unsigned TRGSRC44:1;
      unsigned :3;
      unsigned TRGSRC50:1;
      unsigned TRGSRC51:1;
      unsigned TRGSRC52:1;
      unsigned TRGSRC53:1;
      unsigned TRGSRC54:1;
    };
  };
} ADCPC2BITS;
extern volatile ADCPC2BITS ADCPC2bits __attribute__((__sfr__));

#define ADCPC3 ADCPC3
extern volatile unsigned int  ADCPC3 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC3BITS {
  union {
    struct {
      unsigned TRGSRC6:5;
      unsigned SWTRG6:1;
      unsigned PEND6:1;
      unsigned IRQEN6:1;
    };
    struct {
      unsigned TRGSRC60:1;
      unsigned TRGSRC61:1;
      unsigned TRGSRC62:1;
      unsigned TRGSRC63:1;
      unsigned TRGSRC64:1;
    };
  };
} ADCPC3BITS;
extern volatile ADCPC3BITS ADCPC3bits __attribute__((__sfr__));

#define ADCBUF0 ADCBUF0
extern volatile unsigned int  ADCBUF0 __attribute__((__sfr__));
#define ADCBUF1 ADCBUF1
extern volatile unsigned int  ADCBUF1 __attribute__((__sfr__));
#define ADCBUF2 ADCBUF2
extern volatile unsigned int  ADCBUF2 __attribute__((__sfr__));
#define ADCBUF3 ADCBUF3
extern volatile unsigned int  ADCBUF3 __attribute__((__sfr__));
#define ADCBUF4 ADCBUF4
extern volatile unsigned int  ADCBUF4 __attribute__((__sfr__));
#define ADCBUF5 ADCBUF5
extern volatile unsigned int  ADCBUF5 __attribute__((__sfr__));
#define ADCBUF6 ADCBUF6
extern volatile unsigned int  ADCBUF6 __attribute__((__sfr__));
#define ADCBUF7 ADCBUF7
extern volatile unsigned int  ADCBUF7 __attribute__((__sfr__));
#define ADCBUF8 ADCBUF8
extern volatile unsigned int  ADCBUF8 __attribute__((__sfr__));
#define ADCBUF9 ADCBUF9
extern volatile unsigned int  ADCBUF9 __attribute__((__sfr__));
#define ADCBUF10 ADCBUF10
extern volatile unsigned int  ADCBUF10 __attribute__((__sfr__));
#define ADCBUF11 ADCBUF11
extern volatile unsigned int  ADCBUF11 __attribute__((__sfr__));
#define ADCBUF12 ADCBUF12
extern volatile unsigned int  ADCBUF12 __attribute__((__sfr__));
#define ADCBUF13 ADCBUF13
extern volatile unsigned int  ADCBUF13 __attribute__((__sfr__));
#define PTCON PTCON
extern volatile unsigned int  PTCON __attribute__((__sfr__));
__extension__ typedef struct tagPTCONBITS {
  union {
    struct {
      unsigned SEVTPS:4;
      unsigned SYNCSRC:2;
      unsigned :1;
      unsigned SYNCEN:1;
      unsigned SYNCOEN:1;
      unsigned SYNCPOL:1;
      unsigned EIPU:1;
      unsigned SEIEN:1;
      unsigned SESTAT:1;
      unsigned PTSIDL:1;
      unsigned :1;
      unsigned PTEN:1;
    };
    struct {
      unsigned SEVTPS0:1;
      unsigned SEVTPS1:1;
      unsigned SEVTPS2:1;
      unsigned SEVTPS3:1;
      unsigned SYNCSRC0:1;
      unsigned SYNCSRC1:1;
    };
  };
} PTCONBITS;
extern volatile PTCONBITS PTCONbits __attribute__((__sfr__));

#define PTCON2 PTCON2
extern volatile unsigned int  PTCON2 __attribute__((__sfr__));
__extension__ typedef struct tagPTCON2BITS {
  union {
    struct {
      unsigned PCLKDIV:3;
    };
    struct {
      unsigned PCLKDIV0:1;
      unsigned PCLKDIV1:1;
      unsigned PCLKDIV2:1;
    };
  };
} PTCON2BITS;
extern volatile PTCON2BITS PTCON2bits __attribute__((__sfr__));

#define PTPER PTPER
extern volatile unsigned int  PTPER __attribute__((__sfr__));
#define SEVTCMP SEVTCMP
extern volatile unsigned int  SEVTCMP __attribute__((__sfr__));
#define MDC MDC
extern volatile unsigned int  MDC __attribute__((__sfr__));
#define PWMCON1 PWMCON1
extern volatile unsigned int  PWMCON1 __attribute__((__sfr__));
__extension__ typedef struct tagPWMCON1BITS {
  union {
    struct {
      unsigned IUE:1;
      unsigned XPRES:1;
      unsigned CAM:1;
      unsigned :3;
      unsigned DTC:2;
      unsigned MDCS:1;
      unsigned ITB:1;
      unsigned TRGIEN:1;
      unsigned CLIEN:1;
      unsigned FLTIEN:1;
      unsigned TRGSTAT:1;
      unsigned CLSTAT:1;
      unsigned FLTSTAT:1;
    };
    struct {
      unsigned :6;
      unsigned DTC0:1;
      unsigned DTC1:1;
    };
  };
} PWMCON1BITS;
extern volatile PWMCON1BITS PWMCON1bits __attribute__((__sfr__));

#define IOCON1 IOCON1
extern volatile unsigned int  IOCON1 __attribute__((__sfr__));
__extension__ typedef struct tagIOCON1BITS {
  union {
    struct {
      unsigned OSYNC:1;
      unsigned SWAP:1;
      unsigned CLDAT:2;
      unsigned FLTDAT:2;
      unsigned OVRDAT:2;
      unsigned OVRENL:1;
      unsigned OVRENH:1;
      unsigned PMOD:2;
      unsigned POLL:1;
      unsigned POLH:1;
      unsigned PENL:1;
      unsigned PENH:1;
    };
    struct {
      unsigned :2;
      unsigned CLDAT0:1;
      unsigned CLDAT1:1;
      unsigned FLTDAT0:1;
      unsigned FLTDAT1:1;
      unsigned OVRDAT0:1;
      unsigned OVRDAT1:1;
      unsigned :2;
      unsigned PMOD0:1;
      unsigned PMOD1:1;
    };
  };
} IOCON1BITS;
extern volatile IOCON1BITS IOCON1bits __attribute__((__sfr__));

