Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ16GS504.h
#define _ODCC_ODCC9_POSITION                     0x00000009
#define _ODCC_ODCC9_MASK                         0x00000200
#define _ODCC_ODCC9_LENGTH                       0x00000001

#define _ODCC_ODCC10_POSITION                    0x0000000A
#define _ODCC_ODCC10_MASK                        0x00000400
#define _ODCC_ODCC10_LENGTH                      0x00000001

#define _ODCC_ODCC11_POSITION                    0x0000000B
#define _ODCC_ODCC11_MASK                        0x00000800
#define _ODCC_ODCC11_LENGTH                      0x00000001

#define _ODCC_ODCC12_POSITION                    0x0000000C
#define _ODCC_ODCC12_MASK                        0x00001000
#define _ODCC_ODCC12_LENGTH                      0x00000001

#define _ODCC_ODCC13_POSITION                    0x0000000D
#define _ODCC_ODCC13_MASK                        0x00002000
#define _ODCC_ODCC13_LENGTH                      0x00000001

#define _ADCON_ADCS_POSITION                     0x00000000
#define _ADCON_ADCS_MASK                         0x00000007
#define _ADCON_ADCS_LENGTH                       0x00000003

#define _ADCON_ASYNCSAMP_POSITION                0x00000004
#define _ADCON_ASYNCSAMP_MASK                    0x00000010
#define _ADCON_ASYNCSAMP_LENGTH                  0x00000001

#define _ADCON_SEQSAMP_POSITION                  0x00000005
#define _ADCON_SEQSAMP_MASK                      0x00000020
#define _ADCON_SEQSAMP_LENGTH                    0x00000001

#define _ADCON_ORDER_POSITION                    0x00000006
#define _ADCON_ORDER_MASK                        0x00000040
#define _ADCON_ORDER_LENGTH                      0x00000001

#define _ADCON_EIE_POSITION                      0x00000007
#define _ADCON_EIE_MASK                          0x00000080
#define _ADCON_EIE_LENGTH                        0x00000001

#define _ADCON_FORM_POSITION                     0x00000008
#define _ADCON_FORM_MASK                         0x00000100
#define _ADCON_FORM_LENGTH                       0x00000001

#define _ADCON_GSWTRG_POSITION                   0x0000000A
#define _ADCON_GSWTRG_MASK                       0x00000400
#define _ADCON_GSWTRG_LENGTH                     0x00000001

#define _ADCON_SLOWCLK_POSITION                  0x0000000C
#define _ADCON_SLOWCLK_MASK                      0x00001000
#define _ADCON_SLOWCLK_LENGTH                    0x00000001

#define _ADCON_ADSIDL_POSITION                   0x0000000D
#define _ADCON_ADSIDL_MASK                       0x00002000
#define _ADCON_ADSIDL_LENGTH                     0x00000001

#define _ADCON_ADON_POSITION                     0x0000000F
#define _ADCON_ADON_MASK                         0x00008000
#define _ADCON_ADON_LENGTH                       0x00000001

#define _ADCON_ADCS0_POSITION                    0x00000000
#define _ADCON_ADCS0_MASK                        0x00000001
#define _ADCON_ADCS0_LENGTH                      0x00000001

#define _ADCON_ADCS1_POSITION                    0x00000001
#define _ADCON_ADCS1_MASK                        0x00000002
#define _ADCON_ADCS1_LENGTH                      0x00000001

#define _ADCON_ADCS2_POSITION                    0x00000002
#define _ADCON_ADCS2_MASK                        0x00000004
#define _ADCON_ADCS2_LENGTH                      0x00000001

#define _ADPCFG_PCFG0_POSITION                   0x00000000
#define _ADPCFG_PCFG0_MASK                       0x00000001
#define _ADPCFG_PCFG0_LENGTH                     0x00000001

#define _ADPCFG_PCFG1_POSITION                   0x00000001
#define _ADPCFG_PCFG1_MASK                       0x00000002
#define _ADPCFG_PCFG1_LENGTH                     0x00000001

#define _ADPCFG_PCFG2_POSITION                   0x00000002
#define _ADPCFG_PCFG2_MASK                       0x00000004
#define _ADPCFG_PCFG2_LENGTH                     0x00000001

#define _ADPCFG_PCFG3_POSITION                   0x00000003
#define _ADPCFG_PCFG3_MASK                       0x00000008
#define _ADPCFG_PCFG3_LENGTH                     0x00000001

#define _ADPCFG_PCFG4_POSITION                   0x00000004
#define _ADPCFG_PCFG4_MASK                       0x00000010
#define _ADPCFG_PCFG4_LENGTH                     0x00000001

#define _ADPCFG_PCFG5_POSITION                   0x00000005
#define _ADPCFG_PCFG5_MASK                       0x00000020
#define _ADPCFG_PCFG5_LENGTH                     0x00000001

#define _ADPCFG_PCFG6_POSITION                   0x00000006
#define _ADPCFG_PCFG6_MASK                       0x00000040
#define _ADPCFG_PCFG6_LENGTH                     0x00000001

#define _ADPCFG_PCFG7_POSITION                   0x00000007
#define _ADPCFG_PCFG7_MASK                       0x00000080
#define _ADPCFG_PCFG7_LENGTH                     0x00000001

#define _ADPCFG_PCFG8_POSITION                   0x00000008
#define _ADPCFG_PCFG8_MASK                       0x00000100
#define _ADPCFG_PCFG8_LENGTH                     0x00000001

#define _ADPCFG_PCFG9_POSITION                   0x00000009
#define _ADPCFG_PCFG9_MASK                       0x00000200
#define _ADPCFG_PCFG9_LENGTH                     0x00000001

#define _ADPCFG_PCFG10_POSITION                  0x0000000A
#define _ADPCFG_PCFG10_MASK                      0x00000400
#define _ADPCFG_PCFG10_LENGTH                    0x00000001

#define _ADPCFG_PCFG11_POSITION                  0x0000000B
#define _ADPCFG_PCFG11_MASK                      0x00000800
#define _ADPCFG_PCFG11_LENGTH                    0x00000001

#define _ADSTAT_P0RDY_POSITION                   0x00000000
#define _ADSTAT_P0RDY_MASK                       0x00000001
#define _ADSTAT_P0RDY_LENGTH                     0x00000001

#define _ADSTAT_P1RDY_POSITION                   0x00000001
#define _ADSTAT_P1RDY_MASK                       0x00000002
#define _ADSTAT_P1RDY_LENGTH                     0x00000001

#define _ADSTAT_P2RDY_POSITION                   0x00000002
#define _ADSTAT_P2RDY_MASK                       0x00000004
#define _ADSTAT_P2RDY_LENGTH                     0x00000001

#define _ADSTAT_P3RDY_POSITION                   0x00000003
#define _ADSTAT_P3RDY_MASK                       0x00000008
#define _ADSTAT_P3RDY_LENGTH                     0x00000001

#define _ADSTAT_P4RDY_POSITION                   0x00000004
#define _ADSTAT_P4RDY_MASK                       0x00000010
#define _ADSTAT_P4RDY_LENGTH                     0x00000001

#define _ADSTAT_P5RDY_POSITION                   0x00000005
#define _ADSTAT_P5RDY_MASK                       0x00000020
#define _ADSTAT_P5RDY_LENGTH                     0x00000001

#define _ADSTAT_P6RDY_POSITION                   0x00000006
#define _ADSTAT_P6RDY_MASK                       0x00000040
#define _ADSTAT_P6RDY_LENGTH                     0x00000001

